namespace Niruase.CNPawnNames;

public static partial class NameTables
{
    public static readonly string[] CreepNickPool =
{
    "嘶", "荒", "朽", "灼", "疱", "斑", "息", "刺", "育", "躁",
    "寒", "翻", "裂", "缠", "凝", "攥", "爬", "吱", "蠕", "缩",
    "畏", "暗", "熄", "怖", "漂", "溃", "剥", "肉", "闪", "颤",
    "振", "抖", "磨", "闷", "灼痕", "喘", "微光", "乱影", "沉郁", "怒视",
    "扭曲", "伪善", "苦相", "尘垢", "碾磨", "怨怼", "软骨", "粗砂", "魇", "霾",
    "嚎", "静", "慌", "震", "抖颤", "突刺", "笼罩", "蹒跚", "潜伏", "撕裂",
    "毒瘴", "蜕壳", "飞蛾", "斑驳", "屠戮", "低语", "幽冥", "老朽", "异客", "惨白",
    "疫", "诡计", "尖刺", "震悸", "克制", "怪癖", "颤栗", "摇晃", "渡鸦", "毁灭",
    "撕裂", "激怒", "灼痛", "逃避", "伤损", "灼烧", "劫难", "怒容", "刮擦", "尖啸",
    "疾走", "焦痕", "妖蛇", "暗影", "踉跄", "碎片", "粼光", "寒战", "尖鸣", "裹尸",
    "偏移", "镰刀", "筛落", "海妖", "歪斜", "皮囊", "假面", "躲闪", "倾斜", "劈砍",
    "尾随", "诱捕", "冷笑", "窃笑", "剪断", "滑脱", "狙击", "煤烟", "悲戚", "幽魂",
    "脊骨", "绽开", "拼接", "鬼怪", "喷溅", "污浊", "眯视", "污痕", "烙印", "针脚",
    "污蚀", "纠缠", "破布", "奴役", "悸动", "扭动", "抽搐", "薄纱", "脉络", "烦扰",
    "涡旋", "怪人", "微息", "低语", "惨白", "萎谢", "畏缩", "灵火", "扭曲"
};

    public static readonly string[] CreepLastPool =
    {
    "灰榆", "枯柏", "烬庄", "灰岭", "暗铃", "墨林", "荆棘", "誓约", "残峰", "十字丘",
    "十字谷", "鸦丘", "鸦墟", "残刃", "暗林", "静岸", "雾谷", "雀岭", "雀庄", "鸦林",
    "坟林", "坟丘", "寒墓", "枯木", "寒谷", "鸦堡", "鸦庄", "荆棘岭", "铁锁丘", "铁锁林",
    "夜木", "匠人", "北林", "北谷", "囚岭", "古卷", "赤墓", "盐堡", "银月", "寒水",
    "焚屋", "暗堡", "棘镇", "棘岭", "地底", "白木", "凛冬", "燧石", "青岩", "黏土",
    "寒夫", "黑龙", "焦夫", "血夫", "骨夫", "罗夫", "鸦宁", "隼夫", "金夫", "伊万",
    "龙米尔", "暗鹰", "雪夫", "隼夫", "霜夫", "隼林", "风夫", "兔夫", "叶夫", "夜夫",
    "霜林", "隼巢"
};
}